function _1(md){return(
md`# HW 4 Simple & Medium baseline`
)}

function _2(md){return(
md`Ref: https://observablehq.com/d/c84affd948a1e733`
)}

function _artist(__query,FileAttachment,invalidation){return(
__query(FileAttachment("artist.csv"),{from:{table:"artist"},sort:[],slice:{to:null,from:null},filter:[],select:{columns:null}},invalidation)
)}

function _questionOne(artist){return(
Object.keys(artist[0])[1]
)}

function _questionTwo(artist){return(
Object.keys(artist[0])[16]
)}

function _data(artist,questionOne,questionTwo,buildHierarchy)
{
  let innerAnswer = artist.map(row => row[questionOne]);
  let outerAnswer = artist.map(row => row[questionTwo]);

  let combinedAnswers = innerAnswer.map((innAns, index) => innAns + '-' + outerAnswer[index])

  let reformatAnswers = combinedAnswers.map(item => {
    const [prefix, values] = item.split('-');
    const splitValues = values.split(';').map(value => value.trim());
    return splitValues.map(value => `${prefix}-${value}`);
  }).reduce((acc, curr) => acc.concat(curr), []);

  let answerCounts = {};
  reformatAnswers.forEach(reformatAns => {
    answerCounts[reformatAns] = (answerCounts[reformatAns] || 0) + 1;
  })

  let csvData = Object.entries(answerCounts).map(([answer, count]) => [answer, String(count)]);

  return buildHierarchy(csvData);
}


function _breadcrumb(d3,breadcrumbWidth,breadcrumbHeight,sunburst,breadcrumbPoints,color)
{
  const svg = d3
    .create("svg")
    .attr("viewBox", `0 0 ${breadcrumbWidth * 10} ${breadcrumbHeight}`)
    .style("font", "12px sans-serif")
    .style("margin", "5px");

  const g = svg
    .selectAll("g")
    .data(sunburst.sequence)
    .join("g")
    .attr("transform", (d, i) => `translate(${i * breadcrumbWidth}, 0)`);

    g.append("polygon")
      .attr("points", breadcrumbPoints)
      .attr("fill", d => color(d.data.name))
      .attr("stroke", "white");

    g.append("text")
      .attr("x", (breadcrumbWidth + 10) / 2)
      .attr("y", 15)
      .attr("dy", "0.35em")
      .attr("text-anchor", "middle")
      .attr("fill", "white")
      .text(d => {
        if(d.data.name === "減少包裝材及文宣印製") {
          return "減少包裝";
        }
        else if(d.data.name === "使用無毒媒材、再生材料、廢物利用素材等") {
          return "使用再生材料";
        }
        else if(d.data.name === "工作場所、活動展場的節約能源") {
          return "節約能源";
        }
        else if(d.data.name.length > 6)
        {
          return "其他答案";
        }
        return d.data.name;
      });

  svg
    .append("text")
    .text(sunburst.percentage > 0 ? sunburst.percentage + "%" : "")
    .attr("x", (sunburst.sequence.length + 0.5) * breadcrumbWidth)
    .attr("y", breadcrumbHeight / 2)
    .attr("dy", "0.35em")
    .attr("text-anchor", "middle");

  return svg.node();
}


function _sunburst(partition,data,d3,radius,questionOne,questionTwo,width,color,arc,mousearc)
{
  const root = partition(data);
  const svg = d3.create("svg");
  // Make this into a view, so that the currently hovered sequence is available to the breadcrumb
  const element = svg.node();
  element.value = { sequence: [], percentage: 0.0 };

  // 使用foreignObject插入HTML
  const fo = svg
    .append("foreignObject")
    .attr("x", `${radius+50}px`)
    .attr("y", -10)
    .attr("width", radius*2)
    .attr("height", 350);
  
  const div = fo
    .append("xhtml:div")
    .style("color","#555")
    .style("font-size", "25px")
    .style("font-family", "Arial");

  d3.selectAll("div.tooltip").remove(); // clear tooltips from before
  const tooltip = d3
    .select("body")
    .append("div")
    .attr("class", `tooltip`)
    .style("position", "absolute")
    .style("opacity", 0)

  const label = svg
    .append("text")
    .attr("text-anchor", "middle");
    //.style("visibility", "hidden");

  label//內圈問題
    .append("tspan")
    .attr("class", "question1")
    .attr("x", 0)
    .attr("y", 0)
    .attr("dx", `${radius*2+50}px`)
    .attr("dy", "-6em")
    .attr("font-size", "2.5em")
    .attr("fill", "#BBB")
    .text(questionOne);

  label//外圈問題
    .append("tspan")
    .attr("class", "question2")
    .attr("x", 0)
    .attr("y", 0)
    .attr("dx", `${radius*2+50}px`)
    .attr("dy", "-4em")
    .attr("font-size", "2.5em")
    .attr("fill", "#BBB")
    .text(questionTwo);

  label//答案
    .append("tspan")
    .attr("class", "sequence")
    .attr("x", 0)
    .attr("y", 0)
    .attr("dx", `${radius*2+50}px`)
    .attr("dy", "-1em")
    .attr("font-size", "2.5em")
    .text("");

  label//占比%數
    .append("tspan")
    .attr("class", "percentage")
    .attr("x", 0)
    .attr("y", 0)
    .attr("dx", 0)
    .attr("dy", "0em")
    .attr("font-size", "5em")
    .attr("fill", "#555")
    .text("");

  label//數量
    .append("tspan")
    .attr("class", "dataValue")
    .attr("x", 0)
    .attr("y", 0)
    .attr("dx", 0)
    .attr("dy", "2em")
    .attr("font-size", "2em")
    .attr("fill", "#555")
    .text("");

  svg
    .attr("viewBox", `${-radius} ${-radius} ${width*2.2} ${width}`)
    .style("max-width", `${width*2}px`)
    .style("font", "12px sans-serif");

  const path = svg
    .append("g")
    .selectAll("path")
    .data(
      root.descendants().filter(d => {
        // Don't draw the root node, and for efficiency, filter out nodes that would be too small to see
        return d.depth && d.x1 - d.x0 > 0.001;
      })
    )
    .join("path")
    .attr("fill", d => color(d.data.name))
    .attr("d", arc);

  svg
    .append("g")
    .attr("fill", "none")
    .attr("pointer-events", "all")
    .on("mouseleave", () => {
      path.attr("fill-opacity", 1);
      //tooltip.text("");
      //label.style("visibility", null);
      // Update the value of this view
      element.value = { sequence: [], percentage: 0.0 };
      element.dispatchEvent(new CustomEvent("input"));
    })
    .selectAll("path")
    .data(
      root.descendants().filter(d => {
        // Don't draw the root node, and for efficiency, filter out nodes that would be too small to see
        return d.depth && d.x1 - d.x0 > 0.001;
      })
    )
    .join("path")
    .attr("d", mousearc)
    .on("mouseover", (_evt, d) => {
      if(d.data.name === "減少包裝材及文宣印製") {
        tooltip
        .style("opacity", 1)
        .html(`減少包裝<br><svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="64px" height="64px" viewBox="0 0 128 128" aria-hidden="true" role="img" class="iconify iconify--noto" preserveAspectRatio="xMidYMid meet"><path fill="#ffffff" d="M-183.97 248.8h302.33v169.12h-302.33z"></path><path d="M62.54 4.84L10.38 31.73c-1.14.67-1.47 1.67-1.46 3.12l.1 1.81L64.09 64.9l54.94-27.79s.06-.28.06-1.26c0 0-.05-1.29-.34-1.89c-.32-.68-1-1.29-1.44-1.66c-1.17-.97-2.34-1.83-4.33-2.95C84.45 13.22 65.69 4.91 65.69 4.91c-1.21-.45-2.21-.61-3.15-.07z" fill="#dea66c"></path><path d="M9.74 96.16c3.04 2.01 8.59 4.65 14.2 7.69c13.04 7.06 29.52 15.64 37.72 19.01c1.11.46 1.77.68 2.54.72c.57.03 1.51-.35 1.51-.35s-1.53-55.19-1.62-58.34c-.09-3.08-1.38-4.1-2.52-4.84c-1.78-1.14-5.64-2.92-5.64-2.92s-13.52-6.72-27.02-13.8c-6.42-3.37-11.84-6.82-17.67-9.66c-1.07-.51-2.33.13-2.33 1.33v59.8c0 .57.35 1.05.83 1.36z" fill="#b38251"></path><path d="M117.58 96.51L65.82 123.2c-.83.43-1.82-.17-1.82-1.11l.09-57.18c0-.55-.17-1.76-.34-2.24c-.47-1.4.55-1.96 1.01-2.19l51.34-26.44c1.36-.7 2.99.29 2.99 1.82v58.19c0 1.03-.58 1.98-1.51 2.46z" fill="#966239"></path><path d="M94.46 47.59S66.09 62.1 65.63 63.33c-.46 1.22 22.26-9.7 24.92-11.07c3.01-1.55 26.65-14.19 26.65-15.58c.01-1.14-22.74 10.91-22.74 10.91z" opacity=".5" fill="#212121"></path><g opacity=".5"><path d="M12.81 92.85c3.69 1.86 7.35 3.78 11.91 6.11v-1.78c-4.54-2.32-8.21-4.23-11.91-6.11v1.78z" fill="#212121"></path><path d="M20.58 93.66c1.04.53 1.56.8 2.54 1.3c.01-3.1.01-4.65.02-7.75c-.98-.5-1.49-.76-2.52-1.29c-.02 3.1-.03 4.64-.04 7.74z" fill="#212121"></path><path d="M14.12 90.34c.86.44 1.34.69 2.32 1.19l.05-7.72c-.99-.51-1.47-.75-2.34-1.21c-.01 3.1-.02 4.65-.03 7.74z" fill="#212121"></path><path d="M18.95 85.99c2.37 1.21 3.63 1.86 5.72 2.92c-1.04-1.89-1.61-2.85-2.75-4.79c-1.17.76-1.78 1.13-2.97 1.87z" fill="#212121"></path><path d="M12.81 82.84c1.77.92 2.96 1.53 5.3 2.73c-1.16-1.95-1.74-2.92-2.81-4.83c-1.09.79-1.6 1.2-2.49 2.1z" fill="#212121"></path></g><g opacity=".5"><path d="M31.81 101.4c.83.43 1.26.66 2.09 1.09c-.06-3.68-.09-5.52-.16-9.2c-.8-.42-1.2-.63-2-1.04c.03 3.66.04 5.49.07 9.15z" fill="#212121"></path><path d="M28.76 100.75c3.04 1.6 5.4 2.8 8.32 4.36c-.02-1.05-.83-2.32-1.93-2.91c-1.72-.91-2.7-1.41-4.44-2.32c-1.12-.57-1.95-.16-1.95.87z" fill="#212121"></path><path d="M34.55 90.36l1.28 2.71c-.4.85-.61 1.28-1.03 2.12c.36-.03.54-.04.9-.07c.48-.64.72-.96 1.18-1.6c-.42-.99-.64-1.49-1.08-2.48c1.22.67 1.82 1.01 2.93 1.66c0 3.58-2.34 5.16-5.86 3.32c-3.52-1.83-5.85-5.92-5.85-9.51c2.62 1.31 4.38 2.17 7.53 3.85z" fill="#212121"></path></g><path d="M100.74 41.49c-.5-.37-54.19-28.42-54.19-28.42l-16.66 8.61l55.05 28.39l.03.03l16.11-8.25s-.03-.08-.12-.18c-.07-.06-.19-.15-.22-.18z" fill="#ffe0b2"></path><path d="M101 41.73c-9.12 4.49-16.06 8.34-16.06 8.34c.23.23.24.53.24.68c-.03 1.16-.05 2.08-.08 3.23c-.14 5.95-.22 11.91-.42 17.86c.67-.4 1.48.48 2.09 0c.94-.74 2.94-4 3.24-4.1c.4-.13.83-.03 1.24-.05c1.8-.1 5.83-3.77 6.69-3.94c.83-.16 3.57.37 3.57.37s-.19-18.15-.26-21.2c-.02-1.08-.25-1.19-.25-1.19z" fill="#bf9f85"></path><path d="M-98.73 4.84l-51.83 26.68c-2.52 1.48-1.8 5.09-1.8 5.09l55.17 28.3l55.07-27.86c.05-.17.11-1.21-.15-3.19c-.14-1.04-3.25-2.94-6.03-4.51C-76.82 13.22-95.58 4.91-95.58 4.91c-1.21-.45-2.2-.61-3.15-.07z" fill="#dea66c"></path><path d="M-151.53 96.16c3.04 2.01 8.59 4.65 14.2 7.69c13.04 7.06 29.52 15.64 37.72 19.01c2.45 1.01 3.75.51 3.75.51s-1.15-56.3-1.11-59.45c.02-1.32-1.59-3.12-2.74-3.86c-1.78-1.14-5.64-2.92-5.64-2.92s-13.52-6.72-27.02-13.8c-6.42-3.37-11.84-6.82-17.67-9.66c-1.06-.52-2.33.12-2.32 1.31v59.8c0 .58.36 1.06.83 1.37z" fill="#bf8049"></path><path d="M-43.69 96.51l-51.76 26.69c-.83.43-1.82-.17-1.82-1.11l.09-57.18c0-.55-.41-1.98-.56-2.48c-.14-.5.35-1.51.81-1.74l51.76-26.66c1.36-.7 2.99.29 2.99 1.82v58.19c0 1.04-.58 1.99-1.51 2.47z" fill="#9e673c"></path><path d="M-70.71 52.26c3.01-1.55 26.65-14.19 26.65-15.58c0-1.14-22.75 10.91-22.75 10.91S-95.18 62.1-95.64 63.33c-.45 1.22 22.26-9.7 24.93-11.07z" fill="#212121" opacity=".5"></path><g opacity=".5"><path d="M-148.46 92.85c3.69 1.86 7.35 3.78 11.91 6.11v-1.78c-4.54-2.32-8.21-4.23-11.91-6.11v1.78z" fill="#212121"></path><path d="M-140.69 93.66c1.04.53 1.56.8 2.54 1.3c.01-3.1.01-4.65.02-7.75c-.98-.5-1.49-.76-2.52-1.29c-.01 3.1-.02 4.64-.04 7.74z" fill="#212121"></path><path d="M-147.15 90.34c.86.44 1.34.69 2.32 1.19l.05-7.72c-.99-.51-1.47-.75-2.34-1.21c-.01 3.1-.02 4.65-.03 7.74z" fill="#212121"></path><path d="M-142.32 85.99c2.37 1.21 3.63 1.86 5.72 2.92c-1.04-1.89-1.61-2.85-2.75-4.79c-1.17.76-1.78 1.13-2.97 1.87z" fill="#212121"></path><path d="M-148.46 82.84c1.77.92 2.96 1.53 5.3 2.73c-1.16-1.95-1.74-2.92-2.81-4.83c-1.09.79-1.6 1.2-2.49 2.1z" fill="#212121"></path></g><g opacity=".5"><path d="M-129.46 101.4c.83.43 1.26.66 2.09 1.09c-.06-3.68-.09-5.52-.16-9.2c-.8-.42-1.2-.63-2-1.04c.03 3.66.04 5.49.07 9.15z" fill="#212121"></path><path d="M-132.51 100.75c3.04 1.6 5.4 2.8 8.32 4.36c-.02-1.05-.83-2.32-1.93-2.91c-1.72-.91-2.7-1.41-4.44-2.32c-1.12-.57-1.94-.16-1.95.87z" fill="#212121"></path><path d="M-126.72 90.36l1.28 2.71c-.4.85-.61 1.28-1.03 2.12c.36-.03.54-.04.9-.07c.48-.64.72-.96 1.18-1.6c-.42-.99-.64-1.49-1.08-2.48c1.22.67 1.82 1.01 2.93 1.66c0 3.58-2.34 5.16-5.86 3.32c-3.52-1.83-5.85-5.92-5.85-9.51c2.63 1.31 4.38 2.17 7.53 3.85z" fill="#212121"></path></g><path d="M-61.86 42.33c-.5-.37-54.32-28.49-54.32-28.49l-16.68 8.6l55.11 28.37c4.76-2.45 12.32-6.35 16.12-8.3a1.15 1.15 0 0 0-.23-.18z" fill="#ffe0b2"></path><path d="M-61.63 42.5c-8.34 3.77-16.5 8.11-16.5 8.11c.21.09.73.74.73.74c-.03 1.16-.05 2.31-.08 3.47c-.14 5.95-.22 11.91-.42 17.86c.67-.4 1.48.48 2.09 0c.94-.74 2.94-4 3.24-4.1c.4-.13.83-.03 1.24-.05c1.8-.1 5.83-3.77 6.69-3.94c.83-.16 3.57.37 3.57.37s-.21-18.15-.26-21.2c-.02-.87-.3-1.26-.3-1.26z" fill="#bf9f85"></path><g><path d="M223.81 4.84l-51.83 26.68c-2.52 1.48-1.8 5.09-1.8 5.09l55.17 28.3l55.07-27.86c.05-.17.11-1.21-.15-3.19c-.14-1.04-3.25-2.94-6.03-4.51c-28.53-16.12-47.29-24.42-47.29-24.42c-1.2-.47-2.2-.63-3.14-.09z" fill="#dea66c"></path><path d="M171.01 96.16c3.04 2.01 8.59 4.65 14.2 7.69c13.04 7.06 29.52 15.64 37.72 19.01c2.45 1.01 3.75.51 3.75.51s-1.15-56.3-1.11-59.45c.02-1.32-1.59-3.12-2.74-3.86c-1.78-1.14-5.64-2.92-5.64-2.92s-13.52-6.72-27.02-13.8c-6.42-3.37-11.84-6.82-17.67-9.66c-1.06-.52-2.33.12-2.32 1.31v59.8c0 .58.35 1.06.83 1.37z" fill="#bf8049"></path><path d="M278.85 96.51l-51.76 26.69c-.83.43-1.82-.17-1.82-1.11l.09-57.18c0-.55-.41-1.98-.56-2.48c-.14-.5.35-1.51.81-1.74l51.76-26.66c1.36-.7 2.99.29 2.99 1.82v58.19c0 1.04-.59 1.99-1.51 2.47z" fill="#9e673c"></path><path d="M251.82 52.26c3.01-1.55 26.65-14.19 26.65-15.58c0-1.14-22.75 10.91-22.75 10.91S227.36 62.1 226.9 63.33c-.46 1.22 22.26-9.7 24.92-11.07z" fill="#784d30"></path><g opacity=".85"><path d="M173.36 93.22c3.69 1.86 7.35 3.78 11.91 6.11v-1.78c-4.54-2.32-8.21-4.23-11.91-6.11v1.78z" fill="#784d30"></path><path d="M181.13 94.02c1.04.53 1.56.8 2.54 1.3c.01-3.1.01-4.65.02-7.75c-.98-.5-1.49-.76-2.52-1.29c-.02 3.1-.03 4.65-.04 7.74z" fill="#784d30"></path><path d="M174.67 90.71c.86.44 1.34.69 2.32 1.19l.05-7.72c-.99-.51-1.47-.75-2.34-1.21c-.01 3.09-.02 4.64-.03 7.74z" fill="#784d30"></path><path d="M179.5 86.36c2.37 1.21 3.63 1.86 5.72 2.92c-1.04-1.89-1.61-2.85-2.75-4.79c-1.17.76-1.78 1.13-2.97 1.87z" fill="#784d30"></path><path d="M173.36 83.2c1.77.92 2.96 1.53 5.3 2.73c-1.16-1.95-1.74-2.92-2.81-4.83c-1.09.79-1.6 1.2-2.49 2.1z" fill="#784d30"></path></g><g opacity=".85"><path d="M192.35 101.77c.83.43 1.26.66 2.09 1.09c-.06-3.68-.09-5.52-.16-9.2c-.8-.42-1.2-.63-2-1.04c.04 3.66.05 5.49.07 9.15z" fill="#784d30"></path><path d="M189.31 101.12c3.04 1.6 5.4 2.8 8.32 4.36c-.02-1.05-.83-2.32-1.93-2.91c-1.72-.91-2.7-1.41-4.44-2.32c-1.12-.57-1.95-.16-1.95.87z" fill="#784d30"></path><path d="M195.1 90.73l1.28 2.71c-.4.85-.61 1.28-1.03 2.12c.36-.03.54-.04.9-.07c.48-.64.72-.96 1.18-1.6c-.42-.99-.64-1.49-1.08-2.48c1.22.67 1.82 1.01 2.93 1.66c0 3.58-2.34 5.16-5.86 3.32c-3.52-1.83-5.85-5.92-5.85-9.51c2.62 1.31 4.38 2.17 7.53 3.85z" fill="#784d30"></path></g><path d="M260.68 42.33c-.5-.37-54.32-28.49-54.32-28.49l-16.68 8.6l55.11 28.37c4.76-2.45 12.32-6.35 16.12-8.3c-.07-.06-.14-.12-.23-.18z" fill="#ffe0b2"></path><path d="M260.91 42.5c-8.34 3.77-16.5 8.11-16.5 8.11c.21.09.73.74.73.74c-.03 1.16-.05 2.31-.08 3.47c-.14 5.95-.22 11.91-.42 17.86c.67-.4 1.48.48 2.09 0c.94-.74 2.94-4 3.24-4.1c.4-.13.83-.03 1.24-.05c1.8-.1 5.83-3.77 6.69-3.94c.83-.16 3.57.37 3.57.37s-.21-18.15-.26-21.2c-.02-.87-.3-1.26-.3-1.26z" fill="#bf9f85"></path></g><g><path d="M566.51 4.84l-51.83 26.68c-2.52 1.48-1.8 5.09-1.8 5.09l55.17 28.3l55.07-27.86c.05-.17.11-1.21-.15-3.19c-.14-1.04-3.25-2.94-6.03-4.51c-28.53-16.12-47.29-24.42-47.29-24.42c-1.2-.47-2.2-.63-3.14-.09z" fill="#dea66c"></path><path d="M513.71 96.16c3.04 2.01 8.59 4.65 14.2 7.69c13.04 7.06 29.52 15.64 37.72 19.01c2.45 1.01 3.75.51 3.75.51s-1.15-56.3-1.11-59.45c.02-1.32-1.59-3.12-2.74-3.86c-1.78-1.14-5.64-2.92-5.64-2.92s-13.52-6.72-27.02-13.8c-6.42-3.37-11.84-6.82-17.67-9.66c-1.06-.52-2.33.12-2.32 1.31v59.8c0 .58.35 1.06.83 1.37z" fill="#bf8049"></path><path d="M621.55 96.51l-51.76 26.69c-.83.43-1.82-.17-1.82-1.11l.09-57.18c0-.55-.41-1.98-.56-2.48c-.14-.5.35-1.51.81-1.74l51.76-26.66c1.36-.7 2.99.29 2.99 1.82v58.19a2.815 2.815 0 0 1-1.51 2.47z" fill="#9e673c"></path><path d="M594.52 52.26c3.01-1.55 26.65-14.19 26.65-15.58c0-1.14-22.75 10.91-22.75 10.91S570.06 62.1 569.6 63.33c-.46 1.22 22.26-9.7 24.92-11.07z" fill="#784d30"></path><g opacity=".85"><path d="M516.06 93.22c3.69 1.86 7.35 3.78 11.91 6.11v-1.78c-4.54-2.32-8.21-4.23-11.91-6.11v1.78z" fill="#784d30"></path><path d="M523.82 94.02c1.04.53 1.56.8 2.54 1.3c.01-3.1.01-4.65.02-7.75c-.98-.5-1.49-.76-2.52-1.29c-.01 3.1-.02 4.65-.04 7.74z" fill="#784d30"></path><path d="M517.37 90.71c.86.44 1.34.69 2.32 1.19l.05-7.72c-.99-.51-1.47-.75-2.34-1.21c-.01 3.09-.02 4.64-.03 7.74z" fill="#784d30"></path><path d="M522.2 86.36c2.37 1.21 3.64 1.86 5.72 2.92c-1.04-1.89-1.61-2.85-2.75-4.79c-1.17.76-1.78 1.13-2.97 1.87z" fill="#784d30"></path><path d="M516.06 83.2c1.77.92 2.96 1.53 5.3 2.73c-1.16-1.95-1.74-2.92-2.81-4.83c-1.09.79-1.61 1.2-2.49 2.1z" fill="#784d30"></path></g><g opacity=".85"><path d="M535.05 101.77c.83.43 1.26.66 2.09 1.09c-.06-3.68-.09-5.52-.16-9.2c-.8-.42-1.2-.63-2-1.04c.04 3.66.05 5.49.07 9.15z" fill="#784d30"></path><path d="M532.01 101.12c3.04 1.6 5.4 2.8 8.32 4.36c-.02-1.05-.83-2.32-1.93-2.91c-1.72-.91-2.7-1.41-4.44-2.32c-1.13-.57-1.95-.16-1.95.87z" fill="#784d30"></path><path d="M537.8 90.73l1.28 2.71c-.4.85-.61 1.28-1.03 2.12c.36-.03.54-.04.9-.07c.48-.64.72-.96 1.18-1.6c-.42-.99-.64-1.49-1.08-2.48c1.22.67 1.82 1.01 2.93 1.66c0 3.58-2.34 5.16-5.86 3.32s-5.85-5.92-5.85-9.51c2.62 1.31 4.38 2.17 7.53 3.85z" fill="#784d30"></path></g><path d="M603.38 42.33c-.5-.37-54.32-28.49-54.32-28.49l-16.68 8.6l55.11 28.37c4.76-2.45 12.32-6.35 16.12-8.3c-.07-.06-.14-.12-.23-.18z" fill="#fce8b2"></path><path d="M603.61 42.5c-8.34 3.77-16.5 8.11-16.5 8.11c.21.09.72.74.72.74c-.03 1.16-.05 2.31-.08 3.47c-.14 5.95-.22 11.91-.42 17.86c.67-.4 1.48.48 2.09 0c.94-.74 2.94-4 3.24-4.1c.4-.13.83-.03 1.24-.05c1.8-.1 5.83-3.77 6.69-3.94c.83-.16 3.57.37 3.57.37s-.21-18.15-.26-21.2c-.01-.87-.29-1.26-.29-1.26z" fill="#ecb354"></path></g><g><path d="M62.54 216.07l-51.83 26.68c-2.52 1.48-1.8 5.09-1.8 5.09l55.17 28.3l55.07-27.86c.05-.17.11-1.21-.15-3.19c-.14-1.04-3.25-2.94-6.03-4.51c-28.53-16.12-47.29-24.42-47.29-24.42c-1.2-.47-2.2-.63-3.14-.09z" fill="#dea66c"></path><path d="M9.74 307.39c3.04 2.01 8.59 4.65 14.2 7.69c13.04 7.06 29.52 15.64 37.72 19.01c2.45 1.01 3.75.51 3.75.51s-1.15-56.3-1.11-59.45c.02-1.32-1.59-3.12-2.74-3.86c-1.78-1.14-5.64-2.92-5.64-2.92s-13.52-6.72-27.02-13.8c-6.42-3.37-11.84-6.82-17.67-9.66c-1.06-.52-2.33.12-2.32 1.31v59.8c0 .59.35 1.06.83 1.37z" fill="#bd8955"></path><path d="M117.58 307.74l-51.76 26.69c-.83.43-1.82-.17-1.82-1.11l.09-57.18c0-.55-.41-1.98-.56-2.48c-.14-.5.35-1.51.81-1.74l51.76-26.66c1.36-.7 2.99.29 2.99 1.82v58.19c0 1.04-.58 1.99-1.51 2.47z" fill="#a06841"></path><path d="M90.55 263.49c3.01-1.55 26.65-14.19 26.65-15.58c0-1.14-22.75 10.91-22.75 10.91s-28.37 14.51-28.83 15.74c-.44 1.22 22.27-9.7 24.93-11.07z" fill="#784d30"></path><g opacity=".73"><path d="M12.09 304.45c3.69 1.86 7.35 3.78 11.91 6.11v-1.78c-4.54-2.32-8.21-4.23-11.91-6.11v1.78z" fill="#784d30"></path><path d="M19.86 305.25c1.04.53 1.56.8 2.54 1.3c.01-3.1.01-4.65.02-7.75c-.98-.5-1.49-.76-2.52-1.29c-.02 3.1-.03 4.65-.04 7.74z" fill="#784d30"></path><path d="M13.4 301.94c.86.44 1.34.69 2.32 1.19l.05-7.72c-.99-.51-1.47-.75-2.34-1.21c-.01 3.09-.02 4.64-.03 7.74z" fill="#784d30"></path><path d="M18.23 297.59c2.37 1.21 3.63 1.86 5.72 2.92c-1.04-1.89-1.61-2.85-2.75-4.79c-1.17.76-1.78 1.13-2.97 1.87z" fill="#784d30"></path><path d="M12.09 294.43c1.77.92 2.96 1.53 5.3 2.73c-1.16-1.95-1.74-2.92-2.81-4.83c-1.09.79-1.6 1.2-2.49 2.1z" fill="#784d30"></path></g><g opacity=".73"><path d="M31.09 313c.83.43 1.26.66 2.09 1.09c-.06-3.68-.09-5.52-.16-9.2c-.8-.42-1.2-.63-2-1.04c.03 3.66.04 5.49.07 9.15z" fill="#784d30"></path><path d="M28.04 312.35c3.04 1.6 5.4 2.8 8.32 4.36c-.02-1.05-.83-2.33-1.93-2.91c-1.72-.91-2.7-1.41-4.44-2.32c-1.12-.57-1.95-.16-1.95.87z" fill="#784d30"></path><path d="M33.83 301.96l1.28 2.71c-.4.85-.61 1.28-1.03 2.12c.36-.03.54-.04.9-.07c.48-.64.72-.96 1.18-1.6c-.42-.99-.64-1.49-1.08-2.48c1.22.67 1.82 1.01 2.93 1.66c0 3.58-2.34 5.16-5.86 3.32c-3.52-1.83-5.85-5.92-5.85-9.51c2.62 1.31 4.38 2.17 7.53 3.85z" fill="#784d30"></path></g><path d="M99.41 253.56c-.5-.37-54.32-28.49-54.32-28.49l-16.68 8.6l55.11 28.37c4.76-2.45 12.32-6.35 16.12-8.3c-.06-.06-.14-.12-.23-.18z" fill="#fce8b2"></path><path d="M99.64 253.73c-8.34 3.77-16.5 8.11-16.5 8.11c.21.09.73.74.73.74c-.03 1.16-.05 2.31-.08 3.47c-.14 5.95-.22 11.91-.42 17.86c.67-.4 1.48.48 2.09 0c.94-.74 2.94-4 3.24-4.1c.4-.13.83-.03 1.24-.05c1.8-.1 5.83-3.77 6.69-3.94c.83-.16 3.57.37 3.57.37s-.21-18.15-.26-21.2c-.02-.87-.3-1.26-.3-1.26z" fill="#ecb354"></path></g><g><path d="M401.82 4.84l-51.83 26.68c-2.52 1.48-1.8 5.09-1.8 5.09l55.17 28.3l55.07-27.86c.05-.17.11-1.21-.15-3.19c-.14-1.04-3.25-2.94-6.03-4.51c-28.53-16.12-47.29-24.42-47.29-24.42c-1.2-.47-2.2-.63-3.14-.09z" fill="#e6a467"></path><path d="M349.02 96.16c3.04 2.01 8.59 4.65 14.2 7.69c13.04 7.06 29.52 15.64 37.72 19.01c2.45 1.01 3.75.51 3.75.51s-1.15-56.3-1.11-59.45c.02-1.32-1.59-3.12-2.74-3.86c-1.78-1.14-5.64-2.92-5.64-2.92s-13.52-6.72-27.02-13.8c-6.42-3.37-11.84-6.82-17.67-9.66c-1.06-.52-2.33.12-2.32 1.31v59.8c0 .58.35 1.06.83 1.37z" fill="#d68b52"></path><path d="M456.86 96.51L405.1 123.2c-.83.43-1.82-.17-1.82-1.11l.09-57.18c0-.55-.41-1.98-.56-2.48c-.14-.5.35-1.51.81-1.74l51.76-26.66c1.36-.7 2.99.29 2.99 1.82v58.19a2.815 2.815 0 0 1-1.51 2.47z" fill="#a06841"></path><path d="M429.83 52.26c3.01-1.55 26.65-14.19 26.65-15.58c0-1.14-22.75 10.91-22.75 10.91S405.36 62.1 404.9 63.33c-.45 1.22 22.27-9.7 24.93-11.07z" fill="#784d30"></path><g opacity=".73"><path d="M351.37 93.22c3.69 1.86 7.35 3.78 11.91 6.11v-1.78c-4.54-2.32-8.21-4.23-11.91-6.11v1.78z" fill="#784d30"></path><path d="M359.13 94.02c1.04.53 1.56.8 2.54 1.3c.01-3.1.01-4.65.02-7.75c-.98-.5-1.49-.76-2.52-1.29c-.01 3.1-.02 4.65-.04 7.74z" fill="#784d30"></path><path d="M352.68 90.71c.86.44 1.34.69 2.32 1.19l.05-7.72c-.99-.51-1.47-.75-2.35-1.21c0 3.09-.01 4.64-.02 7.74z" fill="#784d30"></path><path d="M357.51 86.36c2.37 1.21 3.64 1.86 5.72 2.92c-1.04-1.89-1.61-2.85-2.75-4.79c-1.17.76-1.78 1.13-2.97 1.87z" fill="#784d30"></path><path d="M351.37 83.2c1.77.92 2.96 1.53 5.3 2.73c-1.16-1.95-1.74-2.92-2.81-4.83c-1.09.79-1.61 1.2-2.49 2.1z" fill="#784d30"></path></g><g opacity=".73"><path d="M370.36 101.77c.83.43 1.26.66 2.09 1.09c-.06-3.68-.09-5.52-.16-9.2c-.8-.42-1.2-.63-2-1.04c.04 3.66.05 5.49.07 9.15z" fill="#784d30"></path><path d="M367.32 101.12c3.04 1.6 5.4 2.8 8.32 4.36c-.02-1.05-.83-2.32-1.93-2.91c-1.72-.91-2.7-1.41-4.44-2.32c-1.13-.57-1.95-.16-1.95.87z" fill="#784d30"></path><path d="M373.11 90.73l1.28 2.71c-.4.85-.61 1.28-1.03 2.12c.36-.03.54-.04.9-.07c.48-.64.72-.96 1.18-1.6c-.42-.99-.64-1.49-1.08-2.48c1.22.67 1.82 1.01 2.93 1.66c0 3.58-2.34 5.16-5.86 3.32c-3.52-1.83-5.85-5.92-5.85-9.51c2.62 1.31 4.38 2.17 7.53 3.85z" fill="#784d30"></path></g><path d="M438.69 42.33c-.5-.37-54.32-28.49-54.32-28.49l-16.68 8.6l55.11 28.37c4.76-2.45 12.32-6.35 16.12-8.3c-.07-.06-.14-.12-.23-.18z" fill="#fce8b2"></path><path d="M438.92 42.5c-8.34 3.77-16.5 8.11-16.5 8.11c.21.09.73.74.73.74c-.03 1.16-.05 2.31-.08 3.47c-.14 5.95-.22 11.91-.42 17.86c.67-.4 1.48.48 2.09 0c.94-.74 2.94-4 3.24-4.1c.4-.13.83-.03 1.24-.05c1.8-.1 5.83-3.77 6.69-3.94c.83-.16 3.57.37 3.57.37s-.21-18.15-.26-21.2c-.02-.87-.3-1.26-.3-1.26z" fill="#ecb354"></path></g><g><path d="M-240.63 4.84l-51.83 26.68c-2.52 1.48-1.8 5.09-1.8 5.09l55.17 28.3l55.07-27.86c.05-.17.11-1.21-.15-3.19c-.14-1.04-3.25-2.94-6.03-4.51c-28.53-16.12-47.29-24.42-47.29-24.42c-1.2-.47-2.2-.63-3.14-.09z" fill="#e6a475"></path><path d="M-293.43 96.16c3.04 2.01 8.59 4.65 14.2 7.69c13.04 7.06 29.52 15.64 37.72 19.01c2.45 1.01 3.75.51 3.75.51s-1.15-56.3-1.11-59.45c.02-1.32-1.59-3.12-2.74-3.86c-1.78-1.14-5.64-2.92-5.64-2.92s-13.52-6.72-27.02-13.8c-6.42-3.37-11.84-6.82-17.67-9.66c-1.06-.52-2.33.12-2.32 1.31v59.8c0 .58.35 1.06.83 1.37z" fill="#c78c61"></path><path d="M-185.59 96.51l-51.76 26.69c-.83.43-1.82-.17-1.82-1.11l.09-57.18c0-.55-.41-1.98-.56-2.48c-.14-.5.35-1.51.81-1.74l51.76-26.66c1.36-.7 2.99.29 2.99 1.82v58.19a2.815 2.815 0 0 1-1.51 2.47z" fill="#a06841"></path><path d="M-212.62 52.26c3.01-1.55 26.65-14.19 26.65-15.58c0-1.14-22.75 10.91-22.75 10.91s-28.37 14.51-28.83 15.74c-.45 1.22 22.26-9.7 24.93-11.07z" fill="#784d30"></path><g opacity=".73"><path d="M-291.08 93.22c3.69 1.86 7.35 3.78 11.91 6.11v-1.78c-4.54-2.32-8.21-4.23-11.91-6.11v1.78z" fill="#784d30"></path><path d="M-283.32 94.02c1.04.53 1.56.8 2.54 1.3c.01-3.1.01-4.65.02-7.75c-.98-.5-1.49-.76-2.52-1.29c-.01 3.1-.02 4.65-.04 7.74z" fill="#784d30"></path><path d="M-289.77 90.71c.86.44 1.34.69 2.32 1.19l.05-7.72c-.99-.51-1.47-.75-2.34-1.21c-.01 3.09-.02 4.64-.03 7.74z" fill="#784d30"></path><path d="M-284.95 86.36c2.37 1.21 3.63 1.86 5.72 2.92c-1.04-1.89-1.61-2.85-2.75-4.79c-1.16.76-1.77 1.13-2.97 1.87z" fill="#784d30"></path><path d="M-291.08 83.2c1.77.92 2.96 1.53 5.3 2.73c-1.16-1.95-1.74-2.92-2.81-4.83c-1.09.79-1.61 1.2-2.49 2.1z" fill="#784d30"></path></g><g opacity=".73"><path d="M-272.09 101.77c.83.43 1.26.66 2.09 1.09c-.06-3.68-.09-5.52-.16-9.2c-.8-.42-1.2-.63-2-1.04c.04 3.66.05 5.49.07 9.15z" fill="#784d30"></path><path d="M-275.13 101.12c3.04 1.6 5.4 2.8 8.32 4.36c-.02-1.05-.83-2.32-1.93-2.91c-1.72-.91-2.7-1.41-4.44-2.32c-1.13-.57-1.95-.16-1.95.87z" fill="#784d30"></path><path d="M-269.34 90.73l1.28 2.71c-.4.85-.61 1.28-1.03 2.12c.36-.03.54-.04.9-.07c.48-.64.72-.96 1.18-1.6c-.42-.99-.64-1.49-1.08-2.48c1.22.67 1.82 1.01 2.93 1.66c0 3.58-2.34 5.16-5.86 3.32s-5.85-5.92-5.85-9.51c2.62 1.31 4.38 2.17 7.53 3.85z" fill="#784d30"></path></g><path d="M-203.76 42.33c-.5-.37-54.32-28.49-54.32-28.49l-16.68 8.6l55.11 28.37c4.76-2.45 12.32-6.35 16.12-8.3c-.07-.06-.14-.12-.23-.18z" fill="#fce8b2"></path><path d="M-203.54 42.5c-8.34 3.77-16.5 8.11-16.5 8.11c.21.09.73.74.73.74c-.03 1.16-.05 2.31-.08 3.47c-.14 5.95-.22 11.91-.42 17.86c.67-.4 1.48.48 2.09 0c.94-.74 2.94-4 3.24-4.1c.4-.13.83-.03 1.24-.05c1.8-.1 5.83-3.77 6.69-3.94c.83-.16 3.57.37 3.57.37s-.21-18.15-.26-21.2c-.01-.87-.3-1.26-.3-1.26z" fill="#ecb354"></path></g><path d="M90.29-146.79l-10.47 5.4l-21.48 11.07c-3.76 1.94-7.53 3.87-11.29 5.81c-2.52 1.3-7.89 2.93-8.71 6.08c-.18.71-.11 1.45-.03 2.18c.36 3.32.27 6.27 2.43 8.9c2.04 2.48 5.47 5.8 9.01 5.8c8.11 2.65 15.85 6.28 23.82 9.3c7.12 2.7 16.09 6.9 23.36 2.82c.88-.49 1.6-1.16 2.49-1.6c1.19-.59 2.43-1.05 3.61-1.68c3.35-1.77 6.3-4.2 9.47-6.26c5.34-3.48 11.24-5.92 16.99-8.61c2.89-1.35 5.76-2.77 8.49-4.42a47.9 47.9 0 0 0 3.96-2.65c.98-.73 2.71-1.74 3.05-3.01c.05-.17.07-.34.07-.52c-.01-.7-.41-1.34-.94-1.79c-1.76-1.5-4.26-2.28-6.33-3.19c-2.7-1.18-5.24-2.87-7.81-4.32c-5.42-3.06-10.88-6.04-16.38-8.93a675.49 675.49 0 0 0-12.28-6.3c-2.11-1.05-4.22-2.09-6.34-3.13c-1.36-.66-3.13-1.75-4.69-.95z" fill="#e6a475"></path><path d="M38.78-57.74c.77.88 1.81 1.52 2.83 2.1c5.09 2.89 10.31 5.52 15.53 8.2c2.61 1.35 5.23 2.69 7.84 4.04c2.57 1.33 5.15 2.65 7.72 3.98l6.93 3.57c1.82.94 3.64 1.88 5.46 2.81c1.1.57 2.2 1.14 3.31 1.7c1.41.73 2.39 1.44 4.02.85c1.36-.49 1.44-2.15 1.75-3.43c.86-3.51 1.22-7.13 1.37-10.74c.21-4.78.05-9.58-.1-14.36c-.18-5.74.18-11.49-.06-17.26c-.07-1.58-.11-3.17-.16-4.74c-.04-1.39-.89-2.66-1.7-3.74c-.99-1.31-2.11-2.69-2.18-4.33c-.13-2.69-2.81-3.47-4.83-4.36c-3.05-1.35-5.99-3.01-8.96-4.53a1074.144 1074.144 0 0 1-31.34-16.7c-1.25-.69-8.13-6.01-8.16-2.05c-.16 17.81-.33 35.61-.62 53.42c-.03 1.6-.03 3.29.75 4.68c.17.35.37.63.6.89z" fill="#a06841"></path><path d="M144.15-57.63c-1.05 1.05-2.57 1.8-4.5 2.79c-4.13 2.12-8.27 4.25-12.4 6.37c-8.41 4.32-16.81 8.64-25.22 12.95c-1.83.94-8.1 5.04-10.16 4.15c-1.58-.68-.62-8.5-.62-10.22v-22.09v-11.41c0-4.14.39-8.53-.27-12.61c-.2-1.24-.42-2.39.33-3.49c1.2-1.74 4.09-2.67 5.93-3.62c2.23-1.15 4.46-2.3 6.7-3.45c5.66-2.92 11.31-5.83 16.97-8.75l13.5-6.96c2.41-1.24 5.07-3.18 7.66-3.95c2.3-.68 2.74 1.36 2.88 3.28c.4 5.75.33 11.58.46 17.34c.26 11.46.42 22.91.5 34.37c.02 2.61-.58 4.13-1.76 5.3z" fill="#c78c61"></path><g><path d="M117.23-100.16c2.95-1.52 26.07-13.88 26.08-15.24c0-1.12-22.26 10.67-22.26 10.67s-27.76 14.2-28.2 15.4c-.45 1.2 21.77-9.48 24.38-10.83z" fill="#a06841"></path></g><linearGradient id="IconifyId17ecdb2904d178eab14737" gradientUnits="userSpaceOnUse" x1="28.2" y1="-108.368" x2="14.107" y2="-79.066" gradientTransform="matrix(-1 0 0 1 124.88 0)"><stop offset=".31" stop-color="#fce8b2"></stop><stop offset=".399" stop-color="#ffcc80"></stop></linearGradient><path d="M110.19-80.18c.2-5.82.28-11.65.41-17.47c.03-1.13.05-2.26.08-3.39c0 0-.01-.38-.21-.47l-54.04-27.82l16.32-8.41s52.65 27.51 53.14 27.87c.49.36.49.36.51 1.41c.04 2.98.09 5.96.13 8.94l.09 6.16c.01.88.48 3.14.03 3.94c-.44.78-2.68 1.18-3.49 1.34c-.84.16-1.73.23-2.48.66c-1.54.87-2.31 3.09-4.07 3.2c-.41.02-.83-.08-1.22.05c-.29.1-.52.31-.74.52c-.85.81-1.67 1.73-2.59 2.46c-.59.45-1.21.61-1.87 1.01z" fill="url(#IconifyId17ecdb2904d178eab14737)"></path><path d="M127.72-48.65c0-2.64-.18-8.15-.18-8.15s-2.07 1.76-3.37 2.25c-1.02.38-2.13.58-3.02 1.21c-.92.66-1.52 1.71-2.46 2.35c-2.32 1.59-5.48.96-5.48.96v8.86l14.51-7.48z" fill="#ffcc80"></path><g><path d="M40.47-60.08c3.61 1.82 7.19 3.7 11.66 5.98v-1.74c-4.44-2.27-8.03-4.14-11.66-5.98v1.74z" fill="#7d5133"></path><path d="M48.07-59.3c1.01.52 1.52.78 2.49 1.28c.01-3.03.01-4.55.02-7.58c-.95-.49-1.46-.74-2.47-1.26c-.02 3.02-.03 4.54-.04 7.56z" fill="#7d5133"></path><path d="M41.75-62.54c.85.43 1.31.67 2.27 1.16l.05-7.56c-.97-.5-1.43-.74-2.29-1.18c-.01 3.04-.02 4.55-.03 7.58z" fill="#7d5133"></path><path d="M46.47-66.8c2.31 1.19 3.56 1.82 5.59 2.86c-1.02-1.84-1.57-2.79-2.7-4.69c-1.12.75-1.72 1.11-2.89 1.83z" fill="#7d5133"></path><path d="M40.47-69.88c1.73.9 2.89 1.49 5.19 2.67c-1.14-1.91-1.7-2.86-2.75-4.72c-1.07.77-1.57 1.17-2.44 2.05z" fill="#7d5133"></path></g><g><path d="M59.01-52.15c.82.42 1.23.64 2.05 1.07l-.15-9c-.78-.41-1.18-.62-1.95-1.02c.01 3.58.02 5.37.05 8.95z" fill="#7d5133"></path><path d="M56.03-52.78c2.97 1.57 5.29 2.74 8.14 4.27c-.02-1.03-.81-2.27-1.89-2.84c-1.68-.89-2.64-1.38-4.35-2.27c-1.09-.58-1.9-.17-1.9.84z" fill="#7d5133"></path><path d="M61.69-62.95c.5 1.06.76 1.59 1.25 2.65c-.4.83-.6 1.25-1.01 2.08c.36-.03.53-.04.88-.07c.47-.63.7-.94 1.15-1.57c-.41-.97-.63-1.45-1.05-2.43c1.2.65 1.78.99 2.87 1.63c0 3.51-2.29 5.04-5.73 3.25c-3.44-1.79-5.72-5.8-5.72-9.3c2.56 1.28 4.28 2.11 7.36 3.76z" fill="#7d5133"></path></g></svg>`)
        .style("border-color", color(d.data.name));
      }
      else if(d.data.name === "使用無毒媒材、再生材料、廢物利用素材等") {
        tooltip
        .style("opacity", 1)
        .html(`再生材料<br><?xml version="1.0" encoding="utf-8"?><svg width="64px" height="64px" viewBox="0 0 1024 1024" class="icon"  version="1.1" xmlns="http://www.w3.org/2000/svg"><path d="M776.5 569.4c0 210.6-119.5 296.9-266.9 296.9s-267-86.3-267-296.9 267-550.3 267-550.3 266.9 339.7 266.9 550.3z" fill="#60C13D" /><path d="M509.6 876.2c-80.3 0-148-25-195.8-72.3-26-25.7-46-58-59.6-95.9-14.3-39.9-21.6-86.6-21.6-138.6 0-49.3 14.3-109.4 42.4-178.6 22.3-54.9 53.4-115.6 92.4-180.7C433.8 99.6 501 13.8 501.7 12.9c1.9-2.4 4.8-3.8 7.9-3.8s6 1.4 7.9 3.8c0.7 0.9 67.9 86.7 134.2 197.2 39 65 70.1 125.8 92.4 180.7 28.2 69.2 42.4 129.3 42.4 178.6 0 52-7.3 98.7-21.6 138.6-13.6 37.9-33.6 70.2-59.6 95.9-47.7 47.3-115.4 72.3-195.7 72.3z m0-840.7c-19.6 25.8-72.6 97.6-125 185.1-38.5 64.1-69.1 124-91 177.8-27.2 66.7-40.9 124.2-40.9 171 0 96.7 25.3 170.8 75.2 220.3 43.9 43.5 106.8 66.6 181.7 66.6s137.8-23 181.7-66.6c49.9-49.5 75.2-123.6 75.2-220.3 0-46.7-13.8-104.3-41-171.1-21.9-53.9-52.6-113.8-91.1-177.9C582 133 529.1 61.3 509.6 35.5z" fill="" /><path d="M509.6 1017.5c-5.5 0-10-4.5-10-10V218.8c0-5.5 4.5-10 10-10s10 4.5 10 10v788.6c0 5.6-4.5 10.1-10 10.1z" fill="" /><path d="M509.6 521.2c-2.7 0-5.5-1.1-7.4-3.3l-137.5-153c-3.7-4.1-3.4-10.4 0.8-14.1 4.1-3.7 10.4-3.4 14.1 0.8l137.5 153c3.7 4.1 3.4 10.4-0.8 14.1-2 1.7-4.3 2.5-6.7 2.5zM509.6 782.4c-2.8 0-5.6-1.2-7.6-3.5L308.7 552c-3.6-4.2-3.1-10.5 1.1-14.1 4.2-3.6 10.5-3.1 14.1 1.1l193.2 226.9c3.6 4.2 3.1 10.5-1.1 14.1-1.8 1.6-4.1 2.4-6.4 2.4zM509.6 368.2c-2.6 0-5.1-1-7.1-2.9-3.9-3.9-3.9-10.2 0-14.1l93.2-93.2c3.9-3.9 10.2-3.9 14.1 0 3.9 3.9 3.9 10.2 0 14.1l-93.2 93.2c-1.9 1.9-4.5 2.9-7 2.9zM518.6 642.6c-2.7 0-5.5-1.1-7.4-3.3-3.7-4.1-3.3-10.4 0.8-14.1l135.8-121.8c4.1-3.7 10.4-3.3 14.1 0.8 3.7 4.1 3.3 10.4-0.8 14.1L525.3 640c-1.9 1.7-4.3 2.6-6.7 2.6z" fill="" /></svg>`)
        .style("border-color", color(d.data.name));
      }
      else if(d.data.name === "工作場所、活動展場的節約能源") {
        tooltip
        .style("opacity", 1)
        .html(`節約能源<br><?xml version="1.0" encoding="iso-8859-1"?><svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="64px" height="64" viewBox="0 0 297.001 297.001" xml:space="preserve"><g><g><g><g><circle style="fill:#17AB93;" cx="148.5" cy="148.5" r="148.5"/></g></g></g><path style="fill:#107A66;" d="M296.832,141.521l-87.226-87.248L88.401,243.603l53.234,53.234c2.276,0.104,4.564,0.164,6.866,0.164c82.014,0,148.5-66.486,148.5-148.5C297,146.16,296.939,143.834,296.832,141.521z"/><g><path style="fill:#ECF0F1;" d="M82.5,66v165l0,0c0,9.113,7.387,16.5,16.5,16.5h99c9.113,0,16.5-7.387,16.5-16.5l0,0V66H82.5z"/></g><g><path style="fill:#BDC3C7;" d="M198,82.5H99c-9.113,0-16.5-7.387-16.5-16.5l0,0c0-9.113,7.387-16.5,16.5-16.5h99c9.113,0,16.5,7.387,16.5,16.5l0,0C214.5,75.113,207.113,82.5,198,82.5z"/></g><g><g><circle style="fill:#345F41;" cx="125.75" cy="66" r="4"/></g><g><circle style="fill:#345F41;" cx="140.917" cy="66" r="4"/></g><g><circle style="fill:#345F41;" cx="156.083" cy="66" r="4"/></g><g><circle style="fill:#345F41;" cx="171.25" cy="66" r="4"/></g></g><g><rect x="135" y="120.75" style="fill:#5D7486;" width="27" height="13.5"/></g><g><path style="fill:#2ECC71;" d="M131.875,231h33.25c4.487,0,8.125-3.638,8.125-8.125v-82.75c0-4.487-3.638-8.125-8.125-8.125h-33.25c-4.487,0-8.125,3.638-8.125,8.125v82.75C123.75,227.362,127.388,231,131.875,231z"/></g></g></svg>`)
        .style("border-color", color(d.data.name));
      }
      else
      {
        tooltip
        .style("opacity", 1)
        .html(`${d.data.name}`)
        .style("border-color", color(d.data.name));
      }
    })
    .on("mousemove", (evt, d) => {
      tooltip
        .style("top", evt.pageY - 10 + "px")
        .style("left", evt.pageX + 10 + "px");
    })
    .on("mouseout", () => {
      tooltip.style("opacity", 0);
    })
    .on("mouseenter", (event, d) => {
      // Get the ancestors of the current segment, minus the root

      //introduce
      if(d.data.name === "工作室")
      {
        div
          .html("<ul><li>定義：藝術家創作藝術品的私人空間。它可以是一個房間、一棟建築或任何專為藝術製作而設的場所。</li><li>功能：用於藝術家進行創作，例如繪畫、雕塑或任何其他形式的藝術。</li><li>特色：它是一個私密的空間，藝術家可以在這裡自由地實驗、嘗試並發展他們的技巧和創意。</li></ul>");
      }
      else if(d.data.name === "替代空間")
      {
        div
          .html("<ul><li>定義：非傳統和非商業的展示空間。可以是臨時或長期的存在，但不同於傳統的美術館和畫廊。</li><li>功能：提供一個展示非主流、實驗性或邊緣藝術的場所。這些空間通常更加開放、靈活，能夠接受更多風格和形式的藝術品。</li><li>特色：是藝術家、策展人或社群自組、自發的，對於藝術家來說，這樣的空間提供了更多的自由和可能性。</li></ul>");
      }
      else if(d.data.name === "美術館")
      {
        div
          .html("<ul><li>定義：為了展示、保護和研究藝術品而設立的公共或私人機構。</li><li>功能：除了展示藝術品，美術館也負責藝術品的保護、修復、研究和教育等功能。</li><li>特色：通常有較為正式和嚴謹的運作模式。它們可能有長期或特定主題的展覽，且會對藝術品有一定的選擇和評價標準。</li></ul>");
      }
      else
      {
        div.html("");
      }
      
      //dataValue
      label
        .style("visibility", null)
        .select(".dataValue")
        .text("計數："+d.value);
      
      //question
      if(d.depth-1 === 0)
      {
        label
          .style("visibility", null)
          .select(".question1")
          .attr("fill", "#000");
        label
          .style("visibility", null)
          .select(".question2")
          .attr("fill", "#BBB");
      }
      else if(d.depth-1 === 1)
      {
        label
          .style("visibility", null)
          .select(".question1")
          .attr("fill", "#BBB");
        label
          .style("visibility", null)
          .select(".question2")
          .attr("fill", "#000");
      }
      
      const sequence = d
        .ancestors()
        .reverse()
        .slice(1);
      // Highlight the ancestors
      path.attr("fill-opacity", node =>
        sequence.indexOf(node) >= 0 ? 1.0 : 0.3
      );
      label
        .style("visibility", null)
        .select(".sequence")
        //.style("visibility", "visible")
        .attr("fill", sequence => color(d.data.name))
        .text(d.data.name);
      const percentage = ((100 * d.value) / root.value).toPrecision(3);
      label
        .style("visibility", null)
        .select(".percentage")
        .text(percentage + "%");

      /*tooltip
        .text(d.data.name);*/
      
      // Update the value of this view with the currently hovered sequence and percentage
      element.value = { sequence, percentage };
      element.dispatchEvent(new CustomEvent("input"));
    });     

  return element;
}


function _9(md){return(
md`<h2>結論</h2>
<h3>從上圖中，我們可以看出：
  <ul>
    <li>工作室的藝術工作者占此問卷的多數</li>
    <li>藝術工作者採用最多的方式是減少包裝材及文宣印製來減少碳排放量</li>
    <li>藝術工作者前三採用減少碳排料量的方式是: "減少包裝材及文宣印製"、"使用無毒媒材、再生材料、廢物利用素材等"、"工作場所、活動展場的節約能源"</li>
  </ul>
</h3>`
)}

function _buildHierarchy(){return(
function buildHierarchy(csv) {
  // Helper function that transforms the given CSV into a hierarchical format.
  const root = { name: "root", children: [] };
  for (let i = 0; i < csv.length; i++) {
    const sequence = csv[i][0];
    const size = +csv[i][1];
    if (isNaN(size)) {
      // e.g. if this is a header row
      continue;
    }
    const parts = sequence.split("-");
    let currentNode = root;
    for (let j = 0; j < parts.length; j++) {
      const children = currentNode["children"];
      const nodeName = parts[j];
      let childNode = null;
      if (j + 1 < parts.length) {
        // Not yet at the end of the sequence; move down the tree.
        let foundChild = false;
        for (let k = 0; k < children.length; k++) {
          if (children[k]["name"] == nodeName) {
            childNode = children[k];
            foundChild = true;
            break;
          }
        }
        // If we don't already have a child node for this branch, create it.
        if (!foundChild) {
          childNode = { name: nodeName, children: [] };
          children.push(childNode);
        }
        currentNode = childNode;
      } else {
        // Reached the end of the sequence; create a leaf node.
        childNode = { name: nodeName, value: size };
        children.push(childNode);
      }
    }
  }
  return root;
}
)}

function _width(){return(
640
)}

function _radius(){return(
320
)}

function _partition(d3,radius){return(
data =>
  d3.partition().size([2 * Math.PI, radius * radius])(
    d3
      .hierarchy(data)
      .sum(d => d.value)
      .sort((a, b) => b.value - a.value)
  )
)}

function _mousearc(d3,radius){return(
d3
  .arc()
  .startAngle(d => d.x0)
  .endAngle(d => d.x1)
  .innerRadius(d => Math.sqrt(d.y0))
  .outerRadius(radius)
)}

function _color(d3){return(
d3
  .scaleOrdinal()
  .domain(["工作室", "替代空間", "美術館", "減少包裝材及文宣印製", "使用無毒媒材、再生材料、廢物利用素材等", "工作場所、活動展場的節約能源"])
  //.range(d3.schemePaired)
  .range(["#ff8360","#e8e288","#7dce82","#3cdbd3","#00fff5","#cc81be"])
  .unknown("#e9eaec")
)}

function _arc(d3,radius){return(
d3
  .arc()
  .startAngle(d => d.x0)
  .endAngle(d => d.x1)
  .padAngle(1 / radius)
  .padRadius(radius)
  .innerRadius(d => Math.sqrt(d.y0))
  .outerRadius(d => Math.sqrt(d.y1) - 1)
)}

function _breadcrumbWidth(){return(
75
)}

function _breadcrumbHeight(){return(
30
)}

function _breadcrumbPoints(breadcrumbWidth,breadcrumbHeight){return(
function breadcrumbPoints(d, i) {
  const tipWidth = 10;
  const points = [];
  points.push("0,0");
  points.push(`${breadcrumbWidth},0`);
  points.push(`${breadcrumbWidth + tipWidth},${breadcrumbHeight / 2}`);
  points.push(`${breadcrumbWidth},${breadcrumbHeight}`);
  points.push(`0,${breadcrumbHeight}`);
  if (i > 0) {
    // Leftmost breadcrumb; don't include 6th vertex.
    points.push(`${tipWidth},${breadcrumbHeight / 2}`);
  }
  return points.join(" ");
}
)}

function _20(htl){return(
htl.html`<style>
.tooltip {
  padding: 8px 12px;
  color: white;
  border-radius: 6px;
  border: 2px solid rgba(255,255,255,0.5);
  box-shadow: 0 1px 4px 0 rgba(0,0,0,0.2);
  pointer-events: none;
  transform: translate(-50%, -100%);
  font-family: "Helvetica", sans-serif;
  background: rgba(20,10,30,0.6);
  transition: 0.2s opacity ease-out, 0.1s border-color ease-out;
}
</style>`
)}

export default function define(runtime, observer) {
  const main = runtime.module();
  function toString() { return this.url; }
  const fileAttachments = new Map([
    ["artist.csv", {url: new URL("./artist.csv", import.meta.url), mimeType: "text/csv", toString}]
  ]);
  main.builtin("FileAttachment", runtime.fileAttachments(name => fileAttachments.get(name)));
  main.variable(observer()).define(["md"], _1);
  main.variable(observer()).define(["md"], _2);
  main.variable(observer("artist")).define("artist", ["__query","FileAttachment","invalidation"], _artist);
  main.variable(observer("questionOne")).define("questionOne", ["artist"], _questionOne);
  main.variable(observer("questionTwo")).define("questionTwo", ["artist"], _questionTwo);
  main.variable(observer("data")).define("data", ["artist","questionOne","questionTwo","buildHierarchy"], _data);
  main.variable(observer("breadcrumb")).define("breadcrumb", ["d3","breadcrumbWidth","breadcrumbHeight","sunburst","breadcrumbPoints","color"], _breadcrumb);
  main.variable(observer("viewof sunburst")).define("viewof sunburst", ["partition","data","d3","radius","questionOne","questionTwo","width","color","arc","mousearc"], _sunburst);
  main.variable(observer("sunburst")).define("sunburst", ["Generators", "viewof sunburst"], (G, _) => G.input(_));
  main.variable(observer()).define(["md"], _9);
  main.variable(observer("buildHierarchy")).define("buildHierarchy", _buildHierarchy);
  main.variable(observer("width")).define("width", _width);
  main.variable(observer("radius")).define("radius", _radius);
  main.variable(observer("partition")).define("partition", ["d3","radius"], _partition);
  main.variable(observer("mousearc")).define("mousearc", ["d3","radius"], _mousearc);
  main.variable(observer("color")).define("color", ["d3"], _color);
  main.variable(observer("arc")).define("arc", ["d3","radius"], _arc);
  main.variable(observer("breadcrumbWidth")).define("breadcrumbWidth", _breadcrumbWidth);
  main.variable(observer("breadcrumbHeight")).define("breadcrumbHeight", _breadcrumbHeight);
  main.variable(observer("breadcrumbPoints")).define("breadcrumbPoints", ["breadcrumbWidth","breadcrumbHeight"], _breadcrumbPoints);
  main.variable(observer()).define(["htl"], _20);
  return main;
}
